package com.fzu.demo.common.caiutils;

/**
 * 异常代码
 * 0开头表示成功
 * 1开头表示系统异常
 * 2开头表示用户异常
 */
public enum ResponseCode {
    CODE_0("0", "请求成功"),

    /**1开头表示系统异常*/
    CODE_1001("1001", "未知错误"),
    CODE_1002("1002", "参数不能为空"),
    CODE_1003("1003", "无效的版本号"),
    CODE_1004("1004", "无效的token"),
    CODE_1005("1005", "json解析异常"),
    CODE_1006("1006", "OS错误"),
    CODE_1007("1007", "数据库错误"),
    CODE_1008("1008", "数据操作失败"),
    CODE_1009("1009", "参数长度超过最大限制长度"),
    CODE_1010("1010", "记录已经存在"),
    CODE_1011("1011", "用户请求参数异常"),
    CODE_1012("1012", "同一手机号短信发送超过5条"),

    /**2开头表示用户异常*/
    CODE_2001("2001", "用户不存在"),
    CODE_2002("2002", "用户名重复"),
    CODE_2003("2003", "用户名密码不匹配"),
    CODE_2004("2004", "讨论组ID 不存在"),
    CODE_2005("2005", "消息游标不存在"),
    CODE_2006("2006", "会话不存在"),
    CODE_2007("2007", "当前用户所属的公司代码已经过期"),
    CODE_2008("2008", "新旧密码一致，不需要修改"),
    CODE_2009("2009", "用户ID无效"),
    CODE_2010("2010", "创建讨论组的人必须在讨论组中"),
    CODE_2011("2011", "用户已经不在这个讨论组中"),
    CODE_2012("2012", "不需要更新联系人信息"),
    CODE_2013("2013", "用户账号被停用"),
    CODE_2014("2014", "用户不是讨论组的管理员"),
    CODE_2015("2015", "讨论组公告id不存在"),
    CODE_2016("2016", "参数包含非法字符"),
    CODE_2017("2017", "新用户已经是管理员");

    private String code;
    private String desc;

    ResponseCode(String code, String desc) {
        this.code = code;
        this.desc = desc;
    }

    public String getCode() {
        return code;
    }

    public String getDesc() {
        return desc;
    }

}
